Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.RestrictionType
A type of input point restriction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.PointSelectionText
A string used to select input point by some connections.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor(System.String,System.Int32,System.String)
Construct an input point info.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021